DataProcessors/LDAPКлиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>LDAPКлиент</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Хост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Домен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидLDAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>uuid</Name>
					<Comment>Идентификатор подключения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/LDAPКлиент/Ext/ObjectModule.bsl
Перем ПроксиКомпоненты;

///////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ СЕССИЕЙ

#Область УправлениеСессией

Функция ОткрытьСессию() Экспорт
	
	ПроксиКомпоненты = ПроксиКомпоненты();
	
	Соединение = ПроксиКомпоненты.ФабрикаXDTO.Создать("http://ldap.ak.ru/", "connection");
	Соединение.host = Хост;
	Соединение.port = Порт;
	Соединение.login = Пользователь;
	Соединение.password = Пароль;
	Соединение.domain = Домен;
		
	uuid = ПроксиКомпоненты.connect(Соединение, ВидLDAP);
	
КонецФункции

Функция ЗакрытьСессию() Экспорт
	
	ПроксиКомпоненты().disconnect(uuid);		
	uuid = Неопределено;
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// ПРИКЛАДНЫЕ МЕТОДЫ

#Область ПрикладныеМетоды

Функция НайтиВсе(Домен) Экспорт
	
	Возврат ПроксиКомпоненты().searchAll(uuid, Домен);
		
КонецФункции

Функция ПоискПоФильтру(Домен, Фильтр) Экспорт
	
	Возврат ПроксиКомпоненты().searchByFilter(uuid, Домен, Фильтр);
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

Функция ПроксиКомпоненты()
	
	ОписаниеОшибки = Неопределено;
	Если ПроксиКомпоненты = Неопределено Тогда
		ПроксиКомпоненты = КомпонентыJavaПовтИсп.ПроксиКомпоненты(
			Справочники.КомпонентыJava.ldapclient, ОписаниеОшибки);
	КонецЕсли;
		
	Если ПроксиКомпоненты = Неопределено Тогда
		Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОписаниеОшибки = НСтр("ru = 'Java-компонента <LDAP-клиент> не найдена'");
		КонецЕсли;
		
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
			
	Возврат ПроксиКомпоненты;
	
КонецФункции

#КонецОбласти
